Revit 2024 API
StructuralSection.TorsionalModulus Property
 Section modulus for calculations of torsion stresses (Ct).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double TorsionalModulus { get; set; }
Visual Basic
Public Property TorsionalModulus As Double
	Get
	Set
Visual C++
public:
property double TorsionalModulus {
	double get ();
	void set (double value);
}
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace